import os


def generate_xml(config, income_date, supplier, iiko_doc_num, iiko_doc):
    xml_content = f'''<?xml version="1.0" encoding="WINDOWS-1251" ?>
    <Файл ВерсФорм="5.02">

    <СвУчДокОбор>
    <СвОЭДОтпр/>
    </СвУчДокОбор>

    <Документ ВремИнфПр="9.00.00" ДатаИнфПр="{income_date}" КНД="1175010" НаимЭконСубСост="{supplier.get('name')}">
    <СвДокПТПрКроме>
    <СвДокПТПр>
    <НаимДок НаимДокОпр="Товарная накладная" ПоФактХЖ="Документ о передаче товара при торговых операциях"/>
    <ИдентДок ДатаДокПТ="{income_date}" НомДокПТ="{iiko_doc_num}"/>
    <СодФХЖ1>
      <ГрузПолуч ОКПО="06525502">
        <ИдСв>
          <СвОрг>
            <СвЮЛ ИННЮЛ="2311230064" КПП="231001001" НаимОрг="ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ &quot;ЛЕАР ГРУПП&quot;"/>
          </СвОрг>
        </ИдСв>
        <Адрес>
          <АдрИнф АдрТекст="г. Краснодар, ул. им. 40-летия Победы, д. 20, Строение 1, ПОМЕЩЕНИЕ 308, 350042" КодСтр="643"/>
        </Адрес>
        <Контакт Тлф="8 (861) 204-05-06" ЭлПочта="dir@le-ar.ru"/>
        <БанкРекв НомерСчета="40702810512550035771">
          <СвБанк БИК="044525360" КорСчет="30101810445250000360" НаимБанк="Филиал &quot;Корпоративный&quot; ПАО &quot;Совкомбанк&quot; МОСКВА"/>
        </БанкРекв>
      </ГрузПолуч>
      <Продавец>
        <ИдСв>
          <СвОрг>
            <СвЮЛ ИННЮЛ="{supplier.get('inn')}" НаимОрг="{supplier.get('name')}"/>
          </СвОрг>
        </ИдСв>
        <Адрес>
          <АдрИнф АдрТекст="{supplier.get('address')}" КодСтр="643"/>
        </Адрес>
        <Контакт Тлф="{supplier.get('phone')}" ЭлПочта="{supplier.get('email')}"/>
        <БанкРекв НомерСчета="{supplier.get('cardNumber')}">
          <СвБанк/>
        </БанкРекв>
      </Продавец>
      <Покупатель ОКПО="06525502">
        <ИдСв>
          <СвОрг>
            <СвЮЛ ИННЮЛ="2311230064" КПП="231001001" НаимОрг="ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ &quot;ЛЕАР ГРУПП&quot;"/>
          </СвОрг>
        </ИдСв>
        <Адрес>
          <АдрИнф АдрТекст="350042, г. Краснодар, ул. им. 40-летия Победы, д. 20, Строение 1, ПОМЕЩЕНИЕ 308" КодСтр="643"/>
        </Адрес>
        <Контакт Тлф="8 (861) 204-05-06" ЭлПочта="dir@le-ar.ru"/>
        <БанкРекв НомерСчета="40702810512550035771">
          <СвБанк БИК="044525360" КорСчет="30101810445250000360" НаимБанк="Филиал &quot;Корпоративный&quot; ПАО &quot;Совкомбанк&quot; МОСКВА"/>
        </БанкРекв>
      </Покупатель>
      <Основание НаимОсн="Договор" НомОсн="{supplier.get('inn')}"/>
      <ИнфПолФХЖ1>
        <ТекстИнф Значен="{supplier.get('inn')}" Идентиф="ДоговорНомер"/>
      </ИнфПолФХЖ1>
    </СодФХЖ1>
    </СвДокПТПр>      
    <СодФХЖ2>'''

    item_num = 1
    total_price = 0
    total_without_vat = 0
    total_amount = 0
    items = iiko_doc['items']['item']

    if type(items) is dict:
        items = [items]
    for item in items:
        code = item.get("productArticle")
        item_sum = float(item.get('sum', '0'))
        price = float(item.get('price', item_sum))
        vat_percent = float(item.get("vatPercent", '0'))
        actual_amount = float(item.get('actualAmount', '1'))
        price_without_vat = float(item.get('priceWithoutVat', price))

        total_price += item_sum
        total_amount += actual_amount
        total_without_vat += item_sum - (item_sum * vat_percent)

        xml_content += f'''
                                <СвТов КодТов="{code}" НаимЕдИзм="шт" НалСт="без НДС" НеттоПередано="{actual_amount}" НомТов="{item_num}" ОКЕИ_Тов="796" СтБезНДС="{price_without_vat * actual_amount}" СтУчНДС="{item_sum}" Цена="{price}">
                                  <ИнфПолФХЖ2 Значен="{code}" Идентиф="КодПоставщика"/>
                                  <ИнфПолФХЖ2 Значен="{code}" Идентиф="КодПокупателя"/>
                                  <ИнфПолФХЖ2 Значен="&quot;Type&quot;:&quot;Товар&quot;" Идентиф="ПоляНоменклатуры"/>
                                  <ИнфПолФХЖ2 Значен="41-01" Идентиф="СчетУчета"/>
                                </СвТов>'''
        item_num += 1

    xml_content += f'''
                                <Всего НеттоВс="{total_amount}" СтБезНДСВс="{total_without_vat}" СтУчНДСВс="{total_price}"/>
                              </СодФХЖ2>
                            </СвДокПТПрКроме>
                            <СодФХЖ3 СодОпер="Перечисленные в документе ценности переданы"/>
                            </Документ>

                            </Файл>'''

    xml_path = os.path.join("../cash", config['xml_filepath'])
    os.makedirs(os.path.dirname(xml_path), exist_ok=True)
    with open(xml_path, 'w') as file:
        return file.write(xml_content)
